Thanks, it worked! 🎉 

(It seems that `AUTHLETE_API_SERVER` is not necessary if you export `AUTHLETE_API_SERVER_ID`.)
```
% printenv | grep AUTHLETE_                                       
AUTHLETE_API_VERSION=3.0
AUTHLETE_ORGANIZATION_ID=***
AUTHLETE_SO_SECRET=***
AUTHLETE_API_SERVER_ID=53285
AUTHLETE_IDP_SERVER=https://login.authlete.com
% terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # authlete_service.as will be created
  + resource "authlete_service" "as" {
      + access_token_type                     = (known after apply)
      + api_secret                            = (sensitive value)
      + client_id_alias_enabled               = false
      + dcr_scope_used_as_requestable         = (known after apply)
      + direct_authorization_endpoint_enabled = false
      + direct_introspection_endpoint_enabled = (known after apply)
      + direct_jwks_endpoint_enabled          = false
      + direct_revocation_endpoint_enabled    = (known after apply)
      + direct_token_endpoint_enabled         = (known after apply)
      + direct_user_info_endpoint_enabled     = false
      + id                                    = (known after apply)
      + ignore_port_loopback_redirect         = (known after apply)
      + issuer                                = "https://as.mydomain.com"
      + service_name                          = "MyDomainAS"
      + single_access_token_per_subject       = (known after apply)
      + supported_claim_types                 = (known after apply)
      + supported_displays                    = (known after apply)
      + supported_grant_types                 = [
          + "AUTHORIZATION_CODE",
        ]
      + supported_introspection_auth_methods  = (known after apply)
      + supported_response_types              = [
          + "CODE",
        ]
      + supported_revocation_auth_methods     = (known after apply)
      + supported_token_auth_methods          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

authlete_service.as: Creating...
authlete_service.as: Creation complete after 2s [id=***]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```